; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-39)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at ball36 room4)
(at ball37 room4)
(at ball38 room4)
(at ball39 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at ball37 rooma)
(at ball38 rooma)
(at ball39 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 39
2. (pick ball19 roomb left)
   deleted: (at ball19 roomb) (free left)
   added: (carry ball19 left)
   goals met: 11 of 39
3. (pick ball18 roomb right)
   deleted: (at ball18 roomb) (free right)
   added: (carry ball18 right)
   goals met: 11 of 39
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 39
5. (drop ball18 rooma right)
   deleted: (carry ball18 right)
   added: (at ball18 rooma) (free right)
   goals met: 12 of 39
6. (drop ball19 rooma left)
   deleted: (carry ball19 left)
   added: (at ball19 rooma) (free left)
   goals met: 13 of 39
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 39
8. (pick ball17 roomb left)
   deleted: (at ball17 roomb) (free left)
   added: (carry ball17 left)
   goals met: 13 of 39
9. (pick ball16 roomb right)
   deleted: (at ball16 roomb) (free right)
   added: (carry ball16 right)
   goals met: 13 of 39
10. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 39
11. (drop ball16 rooma right)
   deleted: (carry ball16 right)
   added: (at ball16 rooma) (free right)
   goals met: 14 of 39
12. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 15 of 39
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 39
14. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 15 of 39
15. (pick ball14 roomb right)
   deleted: (at ball14 roomb) (free right)
   added: (carry ball14 right)
   goals met: 15 of 39
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 39
17. (drop ball14 rooma right)
   deleted: (carry ball14 right)
   added: (at ball14 rooma) (free right)
   goals met: 16 of 39
18. (drop ball15 rooma left)
   deleted: (carry ball15 left)
   added: (at ball15 rooma) (free left)
   goals met: 17 of 39
19. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 39
20. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 17 of 39
21. (pick ball12 roomb right)
   deleted: (at ball12 roomb) (free right)
   added: (carry ball12 right)
   goals met: 17 of 39
22. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 17 of 39
23. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 17 of 39
24. (drop ball12 rooma right)
   deleted: (carry ball12 right)
   added: (at ball12 rooma) (free right)
   goals met: 18 of 39
25. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 19 of 39
26. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 19 of 39
27. (pick ball39 room4 left)
   deleted: (at ball39 room4) (free left)
   added: (carry ball39 left)
   goals met: 19 of 39
28. (pick ball38 room4 right)
   deleted: (at ball38 room4) (free right)
   added: (carry ball38 right)
   goals met: 19 of 39
29. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 19 of 39
30. (drop ball38 rooma right)
   deleted: (carry ball38 right)
   added: (at ball38 rooma) (free right)
   goals met: 20 of 39
31. (drop ball39 rooma left)
   deleted: (carry ball39 left)
   added: (at ball39 rooma) (free left)
   goals met: 21 of 39
32. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 21 of 39
33. (pick ball37 room4 left)
   deleted: (at ball37 room4) (free left)
   added: (carry ball37 left)
   goals met: 21 of 39
34. (pick ball36 room4 right)
   deleted: (at ball36 room4) (free right)
   added: (carry ball36 right)
   goals met: 21 of 39
35. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 21 of 39
36. (drop ball36 rooma right)
   deleted: (carry ball36 right)
   added: (at ball36 rooma) (free right)
   goals met: 22 of 39
37. (drop ball37 rooma left)
   deleted: (carry ball37 left)
   added: (at ball37 rooma) (free left)
   goals met: 23 of 39
38. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 23 of 39
39. (pick ball35 room4 left)
   deleted: (at ball35 room4) (free left)
   added: (carry ball35 left)
   goals met: 23 of 39
40. (pick ball34 room4 right)
   deleted: (at ball34 room4) (free right)
   added: (carry ball34 right)
   goals met: 23 of 39
41. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 23 of 39
42. (drop ball34 rooma right)
   deleted: (carry ball34 right)
   added: (at ball34 rooma) (free right)
   goals met: 24 of 39
43. (drop ball35 rooma left)
   deleted: (carry ball35 left)
   added: (at ball35 rooma) (free left)
   goals met: 25 of 39
44. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 25 of 39
45. (pick ball33 room4 left)
   deleted: (at ball33 room4) (free left)
   added: (carry ball33 left)
   goals met: 25 of 39
46. (pick ball32 room4 right)
   deleted: (at ball32 room4) (free right)
   added: (carry ball32 right)
   goals met: 25 of 39
47. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 25 of 39
48. (drop ball32 rooma right)
   deleted: (carry ball32 right)
   added: (at ball32 rooma) (free right)
   goals met: 26 of 39
49. (drop ball33 rooma left)
   deleted: (carry ball33 left)
   added: (at ball33 rooma) (free left)
   goals met: 27 of 39
50. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 27 of 39
51. (pick ball31 room4 left)
   deleted: (at ball31 room4) (free left)
   added: (carry ball31 left)
   goals met: 27 of 39
52. (pick ball30 room4 right)
   deleted: (at ball30 room4) (free right)
   added: (carry ball30 right)
   goals met: 27 of 39
53. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 27 of 39
54. (drop ball30 rooma right)
   deleted: (carry ball30 right)
   added: (at ball30 rooma) (free right)
   goals met: 28 of 39
55. (drop ball31 rooma left)
   deleted: (carry ball31 left)
   added: (at ball31 rooma) (free left)
   goals met: 29 of 39
56. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 29 of 39
57. (pick ball29 room4 left)
   deleted: (at ball29 room4) (free left)
   added: (carry ball29 left)
   goals met: 29 of 39
58. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 29 of 39
59. (pick ball28 room3 right)
   deleted: (at ball28 room3) (free right)
   added: (carry ball28 right)
   goals met: 29 of 39
60. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 29 of 39
61. (drop ball28 rooma right)
   deleted: (carry ball28 right)
   added: (at ball28 rooma) (free right)
   goals met: 30 of 39
62. (drop ball29 rooma left)
   deleted: (carry ball29 left)
   added: (at ball29 rooma) (free left)
   goals met: 31 of 39
63. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 31 of 39
64. (pick ball27 room3 left)
   deleted: (at ball27 room3) (free left)
   added: (carry ball27 left)
   goals met: 31 of 39
65. (pick ball26 room3 right)
   deleted: (at ball26 room3) (free right)
   added: (carry ball26 right)
   goals met: 31 of 39
66. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 31 of 39
67. (drop ball26 rooma right)
   deleted: (carry ball26 right)
   added: (at ball26 rooma) (free right)
   goals met: 32 of 39
68. (drop ball27 rooma left)
   deleted: (carry ball27 left)
   added: (at ball27 rooma) (free left)
   goals met: 33 of 39
69. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 33 of 39
70. (pick ball25 room3 left)
   deleted: (at ball25 room3) (free left)
   added: (carry ball25 left)
   goals met: 33 of 39
71. (pick ball24 room3 right)
   deleted: (at ball24 room3) (free right)
   added: (carry ball24 right)
   goals met: 33 of 39
72. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 33 of 39
73. (drop ball24 rooma right)
   deleted: (carry ball24 right)
   added: (at ball24 rooma) (free right)
   goals met: 34 of 39
74. (drop ball25 rooma left)
   deleted: (carry ball25 left)
   added: (at ball25 rooma) (free left)
   goals met: 35 of 39
75. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 35 of 39
76. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 35 of 39
77. (pick ball22 room3 right)
   deleted: (at ball22 room3) (free right)
   added: (carry ball22 right)
   goals met: 35 of 39
78. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 35 of 39
79. (drop ball22 rooma right)
   deleted: (carry ball22 right)
   added: (at ball22 rooma) (free right)
   goals met: 36 of 39
80. (drop ball23 rooma left)
   deleted: (carry ball23 left)
   added: (at ball23 rooma) (free left)
   goals met: 37 of 39
81. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 37 of 39
82. (pick ball21 room3 left)
   deleted: (at ball21 room3) (free left)
   added: (carry ball21 left)
   goals met: 37 of 39
83. (pick ball20 room3 right)
   deleted: (at ball20 room3) (free right)
   added: (carry ball20 right)
   goals met: 37 of 39
84. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 37 of 39
85. (drop ball21 rooma left)
   deleted: (carry ball21 left)
   added: (at ball21 rooma) (free left)
   goals met: 38 of 39
86. (drop ball20 rooma right)
   deleted: (carry ball20 right)
   added: (at ball20 rooma) (free right)
   goals met: 39 of 39
